#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СписокКолонок.Очистить();
	////СписокКолонок.Добавить("ДеревоПроектаПроцентГотовности");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаПоступление");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаВыплата");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаДоход");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаРасход");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаРоли");
	//СписокКолонок.Добавить("ДеревоПроектаКоличествоРоли");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаРесурсы");
	//СписокКолонок.Добавить("ДеревоПроектаКоличествоРесурсы");
	//СписокКолонок.Добавить("ДеревоПроектаСуммаМатериалы");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузитьНастройкуИзВладельца();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКолонокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКолонокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	Для Каждого СтрокаНастройки ИЗ НастройкаКолонок Цикл
		Если СтрокаНастройки.ИмяКолонки = "---" Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНастройки.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	//Оповестить("ИзмененСоставКолонок", , ЭтаФорма);
	//ВладелецФормы.НастройкаКолонок.Очистить();
	МассивНастройки = Новый Массив;
	Для Каждого СтрокаФормы ИЗ НастройкаКолонок Цикл
		СтруктураНастройки = Новый Структура("ИмяКолонки, Видимость, Заголовок, Функция");
		ЗаполнитьЗначенияСвойств(СтруктураНастройки, СтрокаФормы);
		МассивНастройки.Добавить(СтруктураНастройки);
		//ЗаполнитьЗначенияСвойств(ВладелецФормы.НастройкаКолонок.Добавить(), СтрокаФормы);
	КонецЦикла;
	Закрыть(Новый Структура("НастройкиКолонок, КоличествоФиксированныхКолонок", МассивНастройки, КоличествоФиксированныхКолонок));
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереместитьВверх(Команда)
	ТекущиеДанные = Элементы.НастройкаКолонок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементСписка = НастройкаКолонок.Индекс(ТекущиеДанные);
	//Если ЭлементСписка = 0 ИЛИ ЭлементСписка = 4 ИЛИ ЭлементСписка = 5 Тогда
	Если ЭлементСписка = 0 Тогда
		Возврат;
	КонецЕсли;
	НастройкаКолонок.Сдвинуть(ЭлементСписка, -1);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереместитьВниз(Команда)
	ТекущиеДанные = Элементы.НастройкаКолонок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементСписка = НастройкаКолонок.Индекс(ТекущиеДанные);
	//Если ЭлементСписка = НастройкаКолонок.Количество() -1 ИЛИ ЭлементСписка = 4 ИЛИ ЭлементСписка = 3 Тогда
	Если ЭлементСписка = НастройкаКолонок.Количество() -1 Тогда
		Возврат;
	КонецЕсли;

	НастройкаКолонок.Сдвинуть(ЭлементСписка, 1);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	Для Каждого СтрокаНастройки ИЗ НастройкаКолонок Цикл
		Если СтрокаНастройки.ИмяКолонки = "---" Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНастройки.Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПоУмолчанию(Команда)
	СписокКолонок.Очистить();
	СписокКолонок.ЗагрузитьЗначения(ВладелецФормы.ПолучитьСтруктуруНастроекКолонок(Истина).ВыгрузитьЗначения());
	ЗагрузитьНастройкуИзВладельца();
	МассивНастройки = Новый Массив;
	Для Каждого СтрокаФормы ИЗ НастройкаКолонок Цикл
		СтруктураНастройки = Новый Структура("ИмяКолонки, Видимость, Заголовок, Функция");
		ЗаполнитьЗначенияСвойств(СтруктураНастройки, СтрокаФормы);
		МассивНастройки.Добавить(СтруктураНастройки);
	КонецЦикла;
	Оповестить("ИзмененСоставКолонок", Новый Структура("НастройкиКолонок, КоличествоФиксированныхКолонок", МассивНастройки, КоличествоФиксированныхКолонок), ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьНастройкуИзВладельца()
	СписокКолонок.Очистить();
	СписокКолонок.ЗагрузитьЗначения(ВладелецФормы.ПолучитьСтруктуруНастроекКолонок(Ложь).ВыгрузитьЗначения());
	
	КоличествоФиксированныхКолонок = ВладелецФормы.КоличествоФиксированныхКолонок;
	
	НастройкаКолонок.Очистить();
	Для Каждого СтрокаВладельца ИЗ ВладелецФормы.НастройкаКолонок Цикл
		СтрокаНастройки = НастройкаКолонок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, СтрокаВладельца);
		Если СписокКолонок.НайтиПоЗначению(СтрокаНастройки.ИмяКолонки) = Неопределено Тогда
			СтрокаНастройки.Функция = "----";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти